#### Terraform Plan 📋 `stage/network`

**Summary:** 10:56:11.702 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
10:56:01.172 STDOUT terraform: Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
10:56:01.172 STDOUT terraform: will stop streaming the logs, but will not stop the plan running remotely.
10:56:01.172 STDOUT terraform: Preparing the remote plan...
10:56:02.428 STDOUT terraform: To view this run in a browser, visit:
10:56:02.428 STDOUT terraform: https://app.terraform.io/app/my-devops-project/my-devops-project-stage-network/runs/run-2W5EEfJkCW6mVEJG
10:56:03.679 STDOUT terraform: Waiting for the plan to start...
10:56:09.171 STDOUT terraform: Terraform v1.14.0
10:56:09.171 STDOUT terraform: on linux_amd64
10:56:09.171 STDOUT terraform: Initializing plugins and modules...
10:56:11.701 STDOUT terraform: Terraform used the selected providers to generate the following execution
10:56:11.701 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
10:56:11.701 STDOUT terraform:   + create
10:56:11.701 STDOUT terraform: Terraform will perform the following actions:
10:56:11.701 STDOUT terraform:   # digitalocean_vpc.vpc will be created
10:56:11.701 STDOUT terraform:   + resource "digitalocean_vpc" "vpc" {
10:56:11.701 STDOUT terraform:       + created_at = (known after apply)
10:56:11.701 STDOUT terraform:       + default    = (known after apply)
10:56:11.701 STDOUT terraform:       + id         = (known after apply)
10:56:11.701 STDOUT terraform:       + ip_range   = "10.20.0.0/24"
10:56:11.701 STDOUT terraform:       + name       = "stage-vpc"
10:56:11.701 STDOUT terraform:       + region     = "fra1"
10:56:11.702 STDOUT terraform:       + urn        = (known after apply)
10:56:11.702 STDOUT terraform:     }
10:56:11.702 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
10:56:11.702 STDOUT terraform: Changes to Outputs:
10:56:11.702 STDOUT terraform:   + vpc_id     = (known after apply)
10:56:11.702 STDOUT terraform:   + vpc_name   = "stage-vpc"
10:56:11.702 STDOUT terraform:   + vpc_region = "fra1"
10:56:11.793 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
10:56:11.794 STDOUT terraform: Saved the plan to: tfplan
10:56:11.794 STDOUT terraform: To perform exactly these actions, run the following command to apply:
10:56:11.794 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*